import random
spisok=[] #создаём список
k=0
for i in range(100): #заполняем список 100 элементами
  spisok.append(random.randint(0,1000000))
spisok1=spisok.copy()
print('Исходный список: ', spisok)
#############-Сортировка пузырьком-#############
print('--------------------Сортировка пузырьком----------------------')
for i in range(99): #выполняем сортировку пузырьком
  for j in range (99-i):
    k+=1
    if spisok[j] < spisok[j+1]:
      spisok[j], spisok[j+1] = spisok[j+1], spisok[j]
  print('Список: ', spisok)
print('Отсортированный список: ', spisok) #выводим список и кол-во сравнений
print('Количество сравнений:', k)
################################################
#############-Сортировка выбором-###############
k=0
print('--------------------Сортировка выбором----------------------')
for i in range(99): #выполняем сортировку выбором
  m = i
  for j in range(i + 1, 100):
     k+=1
     if spisok1[j] > spisok1[m]:
      m = j
  spisok1[i], spisok1[m] = spisok1[m], spisok1[i]
  print('Список: ', spisok1)
print('Отсортированный список: ', spisok1) #выводим список и кол-во сравнений
print('Количество сравнений:', k)
################################################
